case/J20_inner_case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 330;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    wall
    {
        type            fixedValue;
        value           nonuniform List<scalar>
36979
(
353.90032902622255
353.63997651131484
354.12144078934716
354.0100815677738
354.56109352605097
354.94946069290773
353.9603027375861
352.32907602672265
...
);
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
